.cf.xml/ExchangePlans/обм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ExchangePlan>
		<Properties>
			<Name>обм</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

.cf.xml/ExchangePlans/обм/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Убрать из табличной части дубли параметров и упорядочить табличную часть
	зпрс = Новый Запрос;
	зпрс.УстановитьПараметр("тзПараметры", Параметры.Выгрузить());
	зпрс.Текст =
	"ВЫБРАТЬ
	|	П.Ключ КАК Ключ,
	|	П.Значение КАК Значение,
	|	П.Период КАК Период
	|ПОМЕСТИТЬ тзПараметры
	|ИЗ
	|	&тзПараметры КАК П
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	П.Ключ КАК Ключ,
	|	П.Значение КАК Значение,
	|	П.Период КАК Период
	|ИЗ
	|	тзПараметры КАК П
	|
	|УПОРЯДОЧИТЬ ПО
	|	П.Ключ,
	|	П.Период"; 
	
	ЭтотОбъект.Параметры.Очистить();
	ЭтотОбъект.Параметры.Загрузить(зпрс.Выполнить().Выгрузить());	
	
КонецПроцедуры
